# ACTIVIDAD 5:  CONEXIÓN A BD

In [ ]:
# !pip install psycopg2-binary
# !pip install sqlalchemy
# !pip install pandas

# !pip show psycopg2-binary
# !pip show sqlalchemy

In [18]:
import pandas as pd
from sqlalchemy import create_engine
import psycopg2

hostname= 'localhost'
database= 'BDPrueba'
username= 'postgres'
pwd=''
port_id= '5432'

engine= create_engine(f"postgresql://{username}:{pwd}@localhost:{port_id}/{database}")
engine

Engine(postgresql://postgres:***@localhost:5432/BDPrueba)

In [19]:
from sqlalchemy import text
def runQuery(sql):
    result = engine.connect().execute((text(sql)))
    return pd.DataFrame(result.fetchall(), columns=result.keys())

In [ ]:
query="""
SELECT * FROM clientes
"""
runQuery(query)

In [ ]:
#Insertar los datos en las tablas de productos y clientes
 
ruta_archivos = 'C:/Users/angie.galicia/Downloads/python/BD_excel/'

df = pd.read_csv(ruta_archivos + 'clientes.csv', sep=';')  
df.to_sql('clientes', engine, if_exists='append', index=False)

df = pd.read_csv(ruta_archivos + 'productos.csv', sep=';')  
df.to_sql('productos', engine, if_exists='append', index=False)

In [23]:
query="""
SELECT * FROM clientes
"""
runQuery(query)

   cliente_id  nombre             email telefono             fecha_registro
0           1   Paola   Paola@gmail.com  7589645 2024-09-09 09:29:06.011326
1           2  Andres  Andres@gmail.com  5789632 2024-09-09 09:29:06.011326
2           3   Pedro   Pedro@gmail.com  4569874 2024-09-09 09:29:06.011326
3           4    Juan    Juan@gmail.com  2457896 2024-09-09 09:29:06.011326

In [24]:
query="""
SELECT * FROM productos
"""
runQuery(query)

   producto_id    nombre                   descripcion      precio  stock
0            1   Teclado      Teclado Alámbrico Hp 150    59900.00      5
1            2     Mouse  Mouse HP 100 alámbrico Negro    29999.00      3
2            3   Monitor        Monitor Samsung 24 Led   469999.00      2
3            4  Portatil   Computador Portátil LENOVO   1799999.00      5

In [42]:
from sqlalchemy import text

def ejecutar_sentencia_sql(sentencia):   
    try:
        with engine.begin() as conn:
            conn.execute(text(sentencia))
            print("Sentencia ejecutada correctamente.")
    except Exception as e:
        print(f"Error al ejecutar la sentencia: {e}")

In [43]:
#Insertar datos Pedidos

query="""
    INSERT INTO pedidos (cliente_id, total) values( 1,29999.00);
    INSERT INTO pedidos (cliente_id, total) values( 2,469999.00);
    INSERT INTO pedidos (cliente_id, total) values( 3,1799999.00);
"""
ejecutar_sentencia_sql(query)

Sentencia ejecutada correctamente.

In [45]:
#Insertar datos detalles_pedido

query="""
select pe.pedido_id as Pedido,  cl.nombre as CLiente, pd.nombre as Producto,  d.cantidad as Cantidad, d.precio as Precio
from detalles_pedido d
	inner join pedidos pe on d.pedido_id = pe.pedido_id
	inner join clientes cl on pe.cliente_id = cl.cliente_id	
	inner join productos pd on pd.producto_id = d.producto_id
"""
runQuery(query)

   pedido cliente  producto  cantidad      precio
0      17   Paola     Mouse         1    29999.00
1      18  Andres   Monitor         1   469999.00
2      19   Pedro  Portatil         1  1799999.00